<template>
  <section class="min-h-screen bg-gray-100 p-8">
    <div class="bg-no-repeat bg-cover bg-center fixed top-0 left-0 w-full h-full z-0"
      style="background-image: url('../../assets/images/background.jpg');"></div>

    <div class="relative z-10 max-w-4xl mx-auto bg-white bg-opacity-90 shadow-lg rounded-lg p-6">
      <div class="back">
        <RouterLink to="/"  class="flex flex-row items-center">
          <div class="img items-center mr-2">
            <svg width="24px" height="64px" viewBox="0 0 24 24" fill="none" xmlns="http://www.w3.org/2000/svg">
              <g id="SVGRepo_bgCarrier" stroke-width="0"></g>
              <g id="SVGRepo_tracerCarrier" stroke-linecap="round" stroke-linejoin="round"></g>
              <g id="SVGRepo_iconCarrier">
                <path d="M5 12H19M5 12L11 6M5 12L11 18" stroke="#000000" stroke-width="2" stroke-linecap="round"
                  stroke-linejoin="round"></path>
              </g>
            </svg>
          </div>
          <div class="text">
            Повернутися
          </div>
        </RouterLink>
      </div>
      <h1 class="text-3xl font-bold text-center text-gray-800 mb-4">Політика конфіденційності</h1>

      <p class="text-gray-600 mb-4">
        Ця політика конфіденційності призначена для інформування користувачів цього веб-сайту про тип, обсяг та ціль збору
        особистих даних оператором цього веб-сайту.
      </p>
      <p class="text-gray-600 mb-4">
        Оператор цього веб-сайту цінує вашу конфіденційність та обробляє ваші персональні дані конфіденційно та відповідно
        до законодавчих норм. У зв'язку з новими технологіями та постійним розвитком цього веб-сайту, ця політика
        конфіденційності може змінюватися у майбутньому для пристосування до цих оновлень. Тому ми рекомендуємо вам
        регулярно відвідувати та читати цю політику конфіденційності.
      </p>

      <h2 class="text-2xl font-semibold text-gray-800 mt-8 mb-4">Журнали доступу</h2>
      <p class="text-gray-600 mb-4">
        Ми, оператор цього веб-сайту, збираємо, на основі нашого законного інтересу, дані про доступ до цього веб-сайту та
        зберігаємо їх у так званих "журналах сервера" на сервері цього веб-сайту. Можуть бути зареєстровані такі дані:

        Який веб-сайт був відвіданий
        Дата та час доступу
        Обсяг наданих даних, у байтах
        Додатковий реферер, включаючи інформацію з якого сайту ви могли бути перенаправлені на цей веб-сайт
        Використаний браузер
        Використовувана операційна система
        IP-адреса, з якою здійснено доступ
        Ми зберігаємо ці журнали з метою безпеки, наприклад, для розслідування зловживань. Надані дані потрібно зберігати
        на довготривалому терміні, наприклад, як доказ, тому ми не видаляємо їх доти, доки справа не буде завершена.
      </p>

      <ul class="list-disc list-inside mb-4 text-gray-600">
        <li>Дата та час доступу</li>
        <li>Обсяг наданих даних, у байтах</li>
        <li>Використаний браузер</li>
        <li>IP-адреса, з якою здійснено доступ</li>
      </ul>

      <h2 class="text-2xl font-semibold text-gray-800 mt-8 mb-4">Аудиторія</h2>
      <p class="text-gray-600 mb-4">
        Сайт не спрямований на користувачів із країн Європейського Союзу. Використання послуг сайту з території ЄС здійснюється на власний ризик користувача, який погоджується з умовами цієї Політики конфіденційності.
      </p>

      <h2 class="text-2xl font-semibold text-gray-800 mt-8 mb-4">Обробка даних</h2>
      <p class="text-gray-600 mb-4">
        Ми докладаємо зусиль для дотримання положень Загального регламенту захисту даних (GDPR). У разі використання нашого сайту користувач погоджується на збір та обробку своїх персональних даних відповідно до цієї Політики конфіденційності. 
      </p>

      <h2 class="text-2xl font-semibold text-gray-800 mt-8 mb-4">CFTools Cloud</h2>
      <p class="text-gray-600 mb-4">
        Оператор веб-сайту надає послуги та переваги для донаторів, які використовують сторонній сервіс для їхнього
        надання, CFTools Cloud. CFTools Cloud - це система управління сервером, яка надає функціонал черги пріоритету.

        Для того щоб цей веб-сайт міг надавати переваги пакету, який включає пріоритет у черзі як одну з переваг, на
        CFTools Cloud буде передано наступні особисті дані для налаштування вашого пріоритету у черзі:

        Ваш ідентифікатор Steam
        Додаткові метадані пожертви (такі як ідентифікатор пожертви, ідентифікатор та номер замовлення PayPal, а також
        дата та час здійснення транзакції)
        Ці дані необхідні для забезпечення функціональності цього веб-сайту та є у інтересах оператора цього веб-сайту та
        донатора.

        Додаткову інформацію про те, як ці дані зберігаються та обробляються CFTools Cloud, можна знайти за посиланням:
        https://cftools.cloud/legal/privacy
      </p>

      <h2 class="text-2xl font-semibold text-gray-800 mt-8 mb-4">Особисті дані</h2>
      <p class="text-gray-600 mb-4">
        Оператор веб-сайту збирає, обробляє та передає ваші особисті дані лише в межах законодавчих норм і тільки у разі,
        якщо це необхідно для забезпечення функціональності цього веб-сайту.

        Особисті дані - це будь-яка інформація, за допомогою якої можна ідентифікувати вас як особу або яка може бути
        відстежена до вас - наприклад, ваш ідентифікатор користувача Discord або Steam, ваше ім'я чи електронна адреса.
      </p>

      <h2 class="text-2xl font-semibold text-gray-800 mt-8 mb-4">Обмін даними третіх сторін</h2>
      <p class="text-gray-600">
        Ми можемо надавати вашу інформацію різним третім особам, але лише за потреби. Ми можемо надавати дані
        постачальникам, які використовуються нами для надання вам наших послуг, зокрема постачальникам платіжних послуг,
        яких ми використовуємо для обробки ваших платежів (Stripe і Методи оплати).
      </p>
    </div>
  </section>
</template>